app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings
      @ratings_to_show = {}

      if params[:ratings].nil?
        @ratings_to_show = Movie.all_ratings
      else
        @ratings_to_show = params[:ratings].keys
      end

      # if params[:ratings]
      #   session[:ratings] = params[:ratings]
      #   @ratings_to_show = params[:ratings]
      # end

      if @ratings_to_show == {}
        @movies = Movie.all_ratings.order(params[:sort])
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."NC-17" = '1'